#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=08fbb571-05b5-449d-9e2c-064fc7cf8f37]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1727c957-7c0c-4568-8e15-2360a0a694b5]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=72148b23-94ec-4720-85db-fe2591427029]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5e05d183-7408-41f1-9487-a15b6addefcc]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ff65724e-b3a7-43df-8329-e7a8491b0520]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=546c11d3-53bf-4cac-b41e-fc3f49395d92]
module.keycloak_test.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5e870995-8be2-4a6f-a474-00cd922d1e80]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0c6fe139-8c73-439c-b48f-10e8475d3825]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c42cd3c0-ab71-41e2-89d6-ccb2c8f761e4]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7d402828-fa9c-475f-8b9d-0d8003f2f2d4]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95747622-19c3-4e04-ad80-5ea0571d0aa4]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57fe47be-e87e-4df3-a706-4ea9114fb6c4]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2869ae5d-5b20-4d64-93c8-6f8531d196b1]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d601a422-8a39-4ee4-a653-a6aa886be3d2]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4c883677-33db-4afb-8cad-0db0e2722ac0]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=938f2d9f-bb0a-457f-a2dd-86e043f14d69]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=501b7bca-0bb6-4c47-9117-bf7c198da856]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0a76b429-a810-4915-8b34-44c25abb1c83]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3c515f9a-b6ec-4dad-9ff0-4667f8b71fb6]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=25cb479f-549b-459f-af01-fae3dfa2dcdb]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c9f3b0e2-bc88-49c1-9863-3414a2cb4a79]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb0d0e0a-2f5f-408a-88ce-b13f2041dc2a]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5faab98-04eb-469f-b1a4-bf4c4fbe9478]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a68c05a8-2fd1-4aa8-bccd-0d4dc507bc8e]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0964a154-2cf8-4eed-a061-8c5b8839090b]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75c5ce43-21c0-4adc-9c88-b67094370396]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5e43537d-44da-4dd0-9627-c97d2b19ecc6]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=14f3dc3a-cfcd-436b-b267-2a181961b625]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=11740a6d-e1bc-4358-b69b-d20c40ad6ede]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d939d3b4-e962-4aea-a653-2e5aeb16b57c]
module.keycloak_test.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30f6ac74-bca2-47bd-af4e-e99340d9f388]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fce77ec9-bf10-45fc-8036-6b3a7e3da42b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28a6c18b-6277-44e7-ab77-c9cf786b7059]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9aa05a12-d3f3-478a-8864-a8b80ff52aff]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2f373551-5dfa-4871-9b64-7842ce3be63b]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=df9bdce5-dc0d-4292-9a77-8a5b27569056]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f84f8b82-f177-48a1-9a70-3b374ac8a655]
module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=618c409f-0ca6-4c05-8621-fcdaa8828f9e]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=66601a10-6316-4976-a179-92cbc98062bb]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1274d062-dde2-412d-add4-b0408182422d]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=68611353-ed6f-4be6-a25a-c3d794c5e449]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fc1e28d0-ce21-4546-93e8-c69bdb762700]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75c9af51-b1c8-4786-b358-6589edd18975]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=098aaf25-e9cf-4e19-9c80-d09f57439190]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c91db958-ec4f-459f-9fc5-f25c3006f091]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c47c61ed-5596-4c0d-8bb7-b21284b1fed7]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7a9b8813-1ada-48ac-9710-c22b0bc532cc]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6ba975c2-87f9-4606-9183-002bfaea2ac1]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1d54c0d1-c6c6-4467-b276-e29186e290b8]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=39c59457-0943-4295-a1e7-150411e6e02c]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9df50690-40eb-430e-a01d-c6f211b782e8]
module.keycloak_test.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d7ed3c4e-a200-40af-88c4-5dde1372c4a4]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=12a8562e-1c66-4529-a7e1-7de9e7556ab5]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1d890caa-540a-4cc5-aa56-e088ebd79f2a]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3a22bf8a-4dfe-4929-bce1-f0717aae4d88]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b84511c6-636e-4319-8692-f9554ac6b2fa]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e4330355-a7b5-4bbf-b9b4-54db65deb58a]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3f9170f9-a962-42cb-b9d6-9e7d339dcc87]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06881f5a-9a2a-446d-8330-ecc60c3a7c9d]
module.keycloak_test.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2afbadea-6b81-4b0e-a205-0764134e35f7]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=71fea1dd-088b-4229-beca-942e3b584708]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf3cd2ae-a2fb-4c1b-8056-79059a5fbbd2]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f11c2030-4e36-44ca-87f6-98b74e7adc49]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cbea4edb-dd3e-42e5-b050-a274d6b6fe04]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=625e613f-a43d-4b0c-8753-b584047abd0a]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=aa153c2c-6175-47f4-9705-3dea60504274]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8e6c9aff-1d06-4ed3-aa54-aaabbd46f87c]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=2e0a3f47-e874-4d2d-9b97-209f2e98f43d]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ab008a0e-4343-4fb9-86a5-e2e100e2d3b1]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=128ab502-3de4-49f9-860f-43dd51b718a6]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=79ba1965-8d2e-47f4-ac9a-89708aef294a]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e4f1242b-dc64-4b57-8d67-140d8d85c15f]
module.keycloak_test.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f782eed5-8d94-4f88-a917-a360345c7d49]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ab84a8a-0382-44eb-b424-c7c8aa878c3c]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=644fc2bd-7ab6-451c-b5f1-79d1e80687cf]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6fbe708d-8188-4257-bbf5-e4061824135c]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c157fbc8-b72b-4f28-9442-f2eae59d388e]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd749b5f-13c6-4221-bc92-098523ca8ca2]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=25d32722-1a0a-496c-9c52-fc292c95418a]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b095c4e1-26d7-4b4d-afff-e0502a92195f]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0a6a63a9-d1fa-425a-b9bc-6ac502c5ecda]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73e55553-174f-4151-94ec-f6767f04adb7]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2f20c305-2753-4634-9ed1-3b0423440b76]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4eac1ac7-a1ad-42c9-93a0-19394946574f]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7d3241ce-aede-4a00-b2cc-cfaa04666ee5]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a12fe30-d016-4074-934e-32ea85f2355f]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d097586-7bc1-43cd-9a69-4d9d28d1f3b1]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9df919f6-99ab-457d-a1a6-d9798ee9bff5]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=823b42e2-b1c2-4752-83f6-a32f4eff3ca9]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=25031dab-8d93-4487-a197-0f8797ab5690]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e0e52a27-c642-424b-850e-8b9db6668bc9]
module.keycloak_test.module.onestopauth.module.client_https-bcgov-github-io-sso-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9b71b9b4-2ce6-4190-a861-fde15e62681f]
module.keycloak_test.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=51da3ae1-9ccd-406e-9e42-90389145a322]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7a053e7d-eb39-4181-aa3c-bd345eb19f83]
module.keycloak_test.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=27954b89-dbaf-4b53-b081-be1c297c5619]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1466c781-a06b-4341-8609-2d6c8b094e4f]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7e37bed2-d8ae-44df-bfa5-a5aa09c39d7f]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ae5799df-84e0-4012-83a9-e5707f4112a5]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60266410-7aa2-4db9-b252-ad64a031b48d]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=41430063-49d0-45cd-bc9d-256545fc7800]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5c450301-bc6d-418d-a12f-87cf82bf0009]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6c3e9b37-3446-4b1d-a743-2da792e61b04]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63d308e-aa95-4341-88bc-b61f9e1735ec]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0f521005-8b3e-458d-924d-ac032a340baf]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bdcfe6a7-6c9d-4c16-a944-97e21e373586]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95136448-40b2-405f-a0f7-2a54b784b98d]
module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=44121174-bc07-4fa1-a93b-168a438bcfc7]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=722e7cb3-109f-4692-8c64-c5903cc51dcd]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=64f4da34-9368-4cea-b47d-b5f0fd4e277c]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8cb41a00-1ca8-45e7-9251-da8615bbc4d0]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4f3f5cd9-b6d2-42fd-bacb-efa12781f492]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6ed554bd-d131-42db-a717-564e14e1d0d3]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e9cb28fe-e149-4b71-ab6b-dcca82724882]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=776cb2be-c253-4aba-ab41-0d07c5304167]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=851dcaf5-3f07-4ec0-a372-942d17f56886]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0e28276a-a47c-466a-9fae-a5c9ddcf731f]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a122f0b5-ec48-41f9-a869-12afe4c33a3b]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3a8493f4-71f7-4861-9745-379e307e1361]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b822b48-8674-47cd-ae8c-bf2de27a25b6]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b62befee-13bf-43d9-b574-a31ce9685301]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5429f84b-e3c8-494c-8c77-05c27887609a]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ee484ead-bfaf-4e7b-936a-428db8dd2184]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f970bac4-02cc-4e6b-b01c-e60dfeeea79b]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=06bc1040-cc4b-43a1-a0ac-8c49b8debba1]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79c5210c-89b0-46f1-8c6f-739285d73420]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=71b5ea64-8a6a-4986-8fed-85a3849a3c23]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=752fc084-770c-4359-9976-dfa7cf32ebe8]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=04663036-cf53-4fb7-8d96-89f86b9b1b0b]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-222-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=762a81cd-587b-4349-a881-151ac8cc2723]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "b5d67877-b03a-4427-a174-d514a430096f"
        name                                     = "zz-2806"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2806.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "6abd0a6e-3153-4e43-8ee5-08d74855a284"
        name                                     = "zz-2806"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-2807"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-2807"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-2807.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-2807"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-2807"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-2807"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-2807"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-2807.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-2807"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-2807"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2752 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*